Public Attributes | List of all members
API_StairStructureComponentSettingsVisibilityOnStory Struct Reference
Element Manager
Describes story's stair structure component visibility settings. More...
#include <APIdefs_Elements.h>
 Public Attributes
 bool  | structureVisibility [API_StairStructSymbPartNum][API_StairStructSymbVisibilityNum]
Visibility settings of structure.
 bool  | fillVisibility [API_StairStructSymbPartNum][API_StairStructSymbTypeNum]
Visibility settings of fill.
 API_MonolithPartsVisibilityData  | monolithPartsVisibility [API_StairStructSymbPartNum]
Visibility settings of monolith parts.
Detailed Description
Describes story's stair structure component visibility settings.